{
    "careers":[
        {
            "position": "Software Engineer",
            "company": "Sotera Wireless Inc.",
            "location": "Carlsbad, CA",
            "time": "Sep 2023 - present",
            "Professional Skills": "Java Spring, Angular, Postgres, Docker, AWS",
            "bullets": [
                "Strengthened on-premises Docker server infrastructure and security with authentication and ssl encryption via reverse proxy",
                "Improved system reliability through developing error handling mechanisms and establishing automated build scripts for streamlined deployment workflows",
                "Expanded system capabilities by integrating new data types into distributed health monitoring services",
                "Developed responsive Angular components and implemented full-stack user management features",
                "Utilized Git for version control and collaborative development in an Agile environment"
            ]
        },
        {
            "position": "Software Engineer Intern",
            "company": "My CareLinq Inc.",
            "location": "Los Angeles, CA",
            "time": "May 2022 - August 2022",
            "Professional Skills": "Express.js, React, MongoDB",
            "bullets": [
                "Integrated backend RESTful APIs with third party payment system using JavaScript and Node.js",
                "Developed responsive frontend for payment pipeline using React and Tailwind CSS",
                "Analyzed website usage with Google Analytics and maintain site availability"
            ]
        },
        {
            "position": "Assistant Software Engineer",
            "company": "Industrial Technology Research Institute",
            "location": "Hsinchu, Taiwan",
            "time": "December 2020 - July 2021",
            "Professional Skills": "Python, Android",
            "bullets": [
                "Applied object-oriented design principles to develop maintainable and scalable image processing applications",
                "Utilized Python for implementing U-net CNN model with TensorFlow to enhance accuracy of image processing",
                "Transferred machine learning model and processing flows to Android with TensorFlow Lite and integrated with portable ultrasound devices"
            ]
        }
    ]
}